HELLO_TEXT = (
    "Приветствую, {user_nickname}!\n\nДля получения более детальной информации введите "
    'команду "/help"'
)

ERROR_MESSAGE_TEXT = (
    "Допустимо отправлять только следующие запросы:\n"
    '{"dt_from": "2022-09-01T00:00:00", "dt_upto": "2022-12-31T23:59:00", "group_type":'
    ' "month"}\n'
    '{"dt_from": "2022-10-01T00:00:00", "dt_upto": "2022-11-30T23:59:00", "group_type":'
    ' "day"}\n'
    '{"dt_from": "2022-02-01T00:00:00", "dt_upto": "2022-02-02T00:00:00", "group_type":'
    ' "hour"}'
)

ERROR_MESSAGE_2_TEXT = (
    "Невалидный запрос. Пример запроса:\n"
    '{"dt_from": "2022-09-01T00:00:00", "dt_upto": "2022-12-31T23:59:00", "group_type":'
    ' "month"}'
)

HELP_TEXT = (
    "Это бот агрегации статистических данных о зарплатах сотрудников компании по "
    "временным промежуткам.\n\nФормат входных данных должен быть в виде: \n"
    '{\n\t"dt_from":"2022-09-01T00:00:00",\n\t"dt_upto":"2022-12-31T23:59:00",\n'
    '\t"group_type":"month"\n}'
)
